---
kind: type
id: T:Autodesk.Revit.DB.Architecture.ContinuousRail
source: html/253602af-6809-a579-fc2c-975888d5748c.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail

Represents a continuous rail element in Autodesk Revit.

## Syntax (C#)
```csharp
public class ContinuousRail : Element
```